; 12682 -> 2485
(* 100 (abs (- 126 107)))1900  ; first diff
; 擋在前面 1 格

; 2485 -> 6365
(* 100 (abs (- 24 38)))1400   ; first diff
; 擋在前面 3 格

; 6365 -> 3098
(* 100 (abs (- 63 44)))1900   ; first diff
; 擋在前面 2 格

; 3098 -> 7228
(* 100 (abs (- 30 44)))1400   ; first diff
; 擋在前面 2 格

; 7228 -> 4474
(* 100 (abs (- 72 58)))1400   ; first diff
; 擋在前面 2 格

; 4474 -> 10256
(* 100 (abs (- 44 56)))1200   ; first diff
; 越過 1 格

; 10256 -> 5422
(* 100 (abs (- 102 80)))2200  ; first diff
; 跌破 3 格

; 5422 -> 10393
(* 100 (abs (- 54 68)))1400   ; first diff
; 擋在前面 2 格

; 10393 -> 3411
(* 100 (abs (- 103 89)))1400  ; first diff
; 擋在線上

; 3411 -> 9859
(* 100 (abs (- 34 46)))1200   ; first diff
; 越過 2 格

; 9859 -> 3955
(* 100 (abs (- 98 75)))2300   ; first diff
; 跌破 1 格
