; 大波段, 約 82% 的準確率
12682 -> 2485  ; 撐在 1/2 前 1 格
2485  -> 6365  ; 擋在對應角度前 3 格
6365  -> 3098  ; 撐在 1/2 前 2 格
3098  -> 7228  ; 擋在對應角度前 2 格
7228  -> 4474  ; 撐在圓周角度前 2 格
4474  -> 10256 ; 越過 1/2 後 1 格
10256 -> 5422  ; 跌破 1/2 後 3 格
5422  -> 10393 ; 擋在對應角度前 2 格
10393 -> 3411  ; 撐在 1/2 上
3411  -> 9859  ; 越過圓周角度後 2 格
9859  -> 3955  ; 跌破 1/2 後 1 格

; 中長波段, 太多越過對應角度，不具參考性
6365  -> 4032  ; 跌破對應角度，回到主基數
4032  -> 5459  ; 越過對應角度 1 格
5459  -> 3098  ; 跌破對應角度，回到主基數

3098  -> 5091  ; 越過對應角度，回到主基數
5091  -> 3740  ; 撐在對應角度前 1 格
3740  -> 7228  ; 越過對應角度，回到主基數

10256 -> 7040  ; 跌破對應角度，回到主基數
7040  -> 9378  ; 越過對應角度，回到主基數
9378  -> 5422  ; 跌破對應角度，回到主基數

3411  -> 6484  ; 越過對應角度，回到主基數
6484  -> 3845  ; 跌破對應角度，回到主基數
3845  -> 7135  ; 越過對應角度，回到主基數
7135  -> 5255  ; 撐在對應角度前 1 格
5255  -> 7476  ; 越過對應角度，回到主基數
7476  -> 6232  ; 跌破 1/2 後 3 格
6232  -> 9859  ; 越過對應角度，回到主基數

3955  -> 8395  ; 越過對應角度，回到主基數
8395  -> 7032  ; 跌破對應角度，回到主基數
7032  -> 9220  ; 越過對應角度，回到主基數
9220  -> 6609  ; 跌破對應角度，回到主基數
6609  -> 8170  ; 越過對應角度 1 格
8170  -> 6857  ; 撐在對應角度前 3 格
6857  -> 9593  ; 越過對應角度，回到主基數
9593  -> 8501  ; 跌破 1/2 後 1 格
8501  -> 10014 ; 越過 1/2 後 4 格

; 中波段
12682 -> 10887 ; 撐在對應角度前 1 格
10887 -> 12065 ; 越過 1/2 後 4 格
12065 -> 5822  ; 跌破 1/2 後 3 格
5822  -> 8007  ; 越過 1/2 後 3 格
8007  -> 4450  ; 跌破 1/2 後 2 格
4450  -> 5825  ; 越過對應角度 2 格
5825  -> 2485  ; 撐在 1/2 前 1 格
